Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: If the sequence has no elements, the result is initialResult.
ja: シーケンスが１つも要素を持たないならば、結果はinitialResultです。

source: If the sequence is empty, this method returns true.
ja: シーケンスが空ならば、このメソッドはtrueを返します。

source: If the string passed as stringValue does not correspond to any instance of this type, the result is nil.
ja: stringValueとして渡される値がこの型の何らかのインスタンスと一致しないならば、結果はnilです。

source: If the task this iterator is running in is canceled while next is awaiting a value, this will terminate the AsyncStream and next may return nil immediately (or will return nil on subseuqent calls)
ja: その中でこのイテレータが動作しているところのタスクが、nextが値を待っている間に取り消されるならば、これはAsyncStreamを終端するでしょう、そしてnextはnilを直ぐに返すかもしれません（または続いて起こる呼び出しそれらの上でnilを返すかもしれません）。

source: If the transform returns nil, this method continues to wait for further elements until it gets one that transforms to a non-nil value.
ja: 変換がnilを返すならば、このメソッドはさらに先の要素を待ち続けます、それが非nil値へと変換するものを取得するまで。

source: If the two ranges do not overlap, the result is a single-element range at the upper or lower bound of limits.
ja: ２つの範囲が重ならないならば、結果はlimitsの上方または下方での単一要素範囲です。

source: If the two sequences passed to zip(_:_:) are different lengths, the resulting sequence is the same length as the shorter sequence.
ja: zip(_:_:)に渡された２つのシーケンスが異なる長さであるならは、結果のシーケンスはより短いシーケンスと同じです。

source: If the type of the value pointed to by a C pointer cannot be represented by Swift, as is the case with an incomplete struct type, the pointer is imported as an OpaquePointer.
ja: Cポインタによって指し示される値の型がSwiftによって表現できないならば、不完全なstruct型を持つケース節であるなど、そのポインタはOpaquePointerとしてインポートされます。

source: If the type supports subnormal values, leastNonzeroMagnitude is smaller than leastNormalMagnitude; otherwise they are equal.
ja: その型がサブノーマル値をサポートするならば、leastNonzeroMagnitudeはleastNormalMagnitudeより小さいです；そうでなければそれらは等しいです。

source: If the underlying collection stored by other does not satisfy BidirectionalCollection, the result is nil.
ja: otherによって格納される基礎をなすコレクションがBidirectionalCollectionの条件を満たさないならば、結果はnilです。

source: If the underlying collection stored by other does not satisfy RandomAccessCollection, the result is nil.
ja: otherによって格納される基礎をなすコレクションがRandomAccessCollectionの条件を満たさないならば、結果はnilです。

source: If the value fails to encode anything, encoder will encode an empty keyed container in its place.
ja: 値が何かをエンコードに失敗するならば、encoderは空のキー付きコンテナをその場でエンコードします。

source: If the value is true, the result of the operation is false; if the value is false, the result is true.
ja: 値がtrueならば、この演算の結果はfalseです；値がfalseならば、結果はtrueです。

source: If the value is zero, then leadingZeroBitCount is equal to bitWidth.
ja: 値がゼロならば、そのときleadingZeroBitCountはbitWidthと等しいです。

source: If the value is zero, then trailingZeroBitCount is equal to bitWidth.
ja: 値がゼロならば、そのときtrailingZeroBitCountはbitWidthと等しいです。

source: If the value of an existing key is updated, updateValue(_:forKey:) returns the original value.
ja: 既存のキーの値が更新されるならば、updateValue(_:forKey:)は元の値を返します。

source: If the value of the payload is larger than can be stored as the payload of a Double.nan, the least significant bits are used.
ja: ペイロードの値がDouble.nanのペイロードとして格納可能であるより大きいならば、最下位ビットが使われます。

source: If the value of the payload is larger than can be stored as the payload of a Float16.nan, the least significant bits are used.
ja: ペイロードの値がFloat16.nanのペイロードとして格納可能であるより大きいならば、最下位ビットが使われます。

source: If the value of the payload is larger than can be stored as the payload of a Float80.nan, the least significant bits are used.
ja: ペイロードの値がFloat80.nanのペイロードとして格納可能であるより大きいならば、最下位ビットが使われます。

source: If the value of the payload is larger than can be stored as the payload of a Float.nan, the least significant bits are used.
ja: ペイロードの値がFloat.nanのペイロードとして格納可能であるより大きいならば、最下位ビットが使われます。

source: If the value passed as intValue does not correspond to any instance of this type, the result is nil.
ja: intValueとして渡される値がこの型の何らかのインスタンスと一致しないならば、結果はnilです。

source: If the value passed as source is greater than the maximum representable value in this type, the result is the type’s max value.
ja: sourceとして渡された値がこの型において最大限の表現可能な値より大きいならば、結果はこの型のもつmax値です。

source: If the value passed as source is not representable exactly, the result is nil.
ja: sourceとして渡された値が正確に表現可能でないならば、結果はnilです。

source: If the value passed as source is not representable in this type, a runtime error may occur.
ja: sourceとして渡された値がこの型で表現可能でないならば、実行時エラーが起こるでしょう。

source: If the value you pass to significand is NaN, the result is NaN.
ja: あなたがsignificandに渡す値がNaNならば、結果はNaNです。

source: If the value you pass to significand is zero or infinite, the result is zero or infinite, regardless of the value of exponent.
ja: あなたがsignificandに渡す値がゼロまたは無限大ならば、結果はゼロまたは無限大です、exponentの値に関係なく。

source: If there are additional details about the error that could be helpful for recovery, use associated values to include that information.
ja: 復旧の助けになりうるそのエラーについての追加の詳細があるならば、関連値を使ってその情報を含めてください。

source: If there are multiple equal greatest arguments, the result is the last one.
ja: 等しい最大の引数が複数あるならば、結果は最後のものです。

source: If there are multiple equal least arguments, the result is the first one.
ja: 複数の最も少ない引数があるならば、結果は最初の１つです。

source: If there is no upper limit, then significandBitCount should be Int.max.
ja: 上限がないならば、そのときsignificandBitCountはInt.maxです。

source: If there is no value of the type that corresponds with the specified raw value, this initializer returns nil.
ja: 指定された生の値に対応する型の値が１つもないならば、このイニシャライザはnilを返します。

source: If this call succeeds, this method passes along the element.
ja: この呼び出しが成功するならば、このメソッドは要素を先へ渡します。

source: If this character does not represent a whole number, or the value is too large to represent as an Int, the value of this property is nil.
ja: この文字が整数を表さない、またはその値がIntとして表すには大きすぎるならば、このプロパティの値はnilです。

source: If this type has value semantics, the mirror should be unaffected by subsequent mutations of the instance.
ja: この型が値意味論を持つならば、ミラーはインスタンスのその後の変化によって影響を受けないべきです。

source: If this type’s Stride type conforms to BinaryInteger, then for a value x, a distance n, and a value y = x.advanced(by: n), x.distance(to: y) == n.
ja: この型のもつStride型がBinaryIntegerに準拠するならば、そのとき値x、隔たりn、そして値y = x.advanced(by: n)に対して、x.distance(to: y) == n。

source: If this type’s Stride type conforms to BinaryInteger, then for two values x and y, and a distance n = x.distance(to: y), x.advanced(by: n) == y.
ja: この型のもつStride型がBinaryIntegerに準拠するならば、そのとき２つの値xとy、そして隔たりn = x.distance(to: y)に対して、x.advanced(by: n) == y。

source: If this value and other are both finite numbers, the truncating remainder has the same sign as this value and is strictly smaller in magnitude than other.
ja: この値とotherが両方とも有限の数ならば、切り捨てられる余りはこの値と同じ符号を持ち、そして厳密にotherより小さい規模になります。

source: If this value and other are finite numbers, the remainder is in the closed range -abs(other / 2)...abs(other / 2).
ja: この値とotherが有限数ならば、あまりは完結範囲-abs(other / 2)...abs(other / 2)の中に入ります。

source: If this value is a finite nonzero number, significandWidth is the number of fractional bits required to represent the value of significand; otherwise, significandWidth is -1.
ja: この値が有限の非ゼロ数ならば、significandWidthはsignificandの値を表すのに必要とされる小数部ビットの数です；そうでなければ、significandWidthは-1です

source: If those compatible types use different definitions for equality, values that were originally distinct might compare as equal when they are converted to AnyHashable:
ja: それらの互換型が同等性に対して異なる定義を使うならば、元来は異なるものであった値それらは、等しいとみなされるかもしれません、それらがAnyHashableに変換される場合は：

source: If two representable values are equally close, the result is the value with more trailing zeros in its significand bit pattern.
ja: ２つの表現可能な値が同等であるくらい近いならば、結果はその仮数ビットパターンにおいてより多く後ろに続くゼロを持つ値です。

source: If you accept, Xcode creates the bridging header file along with the file you were creating, and names it by using your product module name followed by "-Bridging-Header.h".
ja: あなたが承諾するならば、Xcodeはブリッジヘッダファイルをあなたが作成していたファイルに加えて作成します、そしてあなたのプロダクトモジュール名に"-Bridging-Header.h"を続けることでそれに名前をつけます。

source: If you are adding a known number of elements to an array, use this method to avoid multiple reallocations.
ja: あなたが数のわかった要素を配列に加えているならば、このメソッドを使って複数の再割り当てを避けてください。

source: If you are adding a known number of key-value pairs to a dictionary, use this method to avoid multiple reallocations.
ja: あなたが数のわかったキー値ペアを辞書に加えているならば、このメソッドを使って複数の再割り当てを避けてください。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison instead.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、代わりにString APIを使うべきです、それはローカライズされた比較を実行します。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、String APIを使うべきです、それはローカライズされた比較を実行します。

source: If you assign nil as the value for the given key, the dictionary removes that key and its associated value.
ja: あなたが与えられたキーに値としてnilを割り当てるならば、辞書はそのキーとそれの結び付けられた値を削除します。

source: If you assign nil to an existing key, the key and its associated value are removed.
ja: あなたがnilを既存のキーに割り当てるならば、そのキーとそれの関連値は削除されます。

source: If you call async(priority:operation:) to create a new task in a canceled group, that task is immediately canceled after creation.
ja: あなたがasync(priority:operation:)を呼び出すことで新しいタスクをある取り消されたグループの中に作成するならば、そのタスクは作成の後に直ぐに取り消されます。

source: If you call async(priority:operation:) to create a new task in a canceled group, that task is is immediately canceled after being created.
ja: あなたがasync(priority:operation:)を呼び出すことで新しいタスクをある取り消されたグループの中に作成するならば、そのタスクは作成される後に直ぐに取り消されます。

source: If you call this function from the body of an asynchronous function, the unsafe task handle passed to the closure is always non-nil because an asynchronous function always runs in the context of a task.
ja: あなたがこの関数を非同期関数の本体から呼び出すならば、クロージャに渡された非安全タスクハンドルは常に非nilです、なぜなら非同期関数は常にあるタスクの文脈において動作するからです。

source: If you change a reference to an object in one array, only that array has a reference to the new object.
ja: あなたがある配列におけるあるオブジェクトへの参照を変更するならば、単にその配列が新しいオブジェクトへの参照を持つだけです。

source: If you compare two instances of that type, whether or not the computed value has been cached shouldn't affect their equality, so the cached value should be excluded from comparison and hashing.
ja: あなたがその型の２つのインスタンスを比較するならば、計算値がキャッシュされるかどうかが、それらの同等性に影響すべきではありません、なのでキャッシュされた値は比較およびハッシュ化から排除されるべきです。

source: If you create a custom sequence that can provide repeated access to its elements, make sure that its type conforms to the Collection protocol in order to give a more useful and more efficient interface for sequence and collection operations.
ja: あなたがそれの要素に繰り返しアクセスを提供できるあつらえのシーケンスを作成しているならば、より実用的でより効率的なインターフェイスをシーケンスおよびコレクション演算に与えるために、それの型がCollectionプロトコルに準拠するのを確実にしてください。

source: If you don't need to know how a property has changed, omit the options parameter.
ja: あなたがどのようにプロパティが変更されたか知る必要がないならば、optionsパラメータを省略します。

source: If you don't need to respond to events, you don't need to create a delegate.
ja: あなたがイベントに応答することを必要としないならば、あなたは委任先を作成する必要はありません。

source: If you don’t want the default behavior or don’t want to construct a String, use a custom type conforming to StringInterpolationProtocol instead.
ja: あなたが初期状態の挙動を望まないまたはStringを組み立てることを望まないならば、代わりにStringInterpolationProtocolに準拠するあるあつらえの型を使ってください。

source: If you have prior knowledge that an AnyObject instance has a particular type, you can use the unconditional downcast operator (as!).
ja: あなたがAnyObjectインスタンスがある特定の型を持つという事前の知識を持つならば、無条件のダウンキャスト演算子（as!）を使うことも可能です。

source: If you implement CustomDebugStringConvertible conformance for your custom type, you may want to consider providing a custom mirror by implementing CustomReflectable conformance, as well.
ja: あなたがCustomDebugStringConvertible準拠をあなたのあつらえの型に実装するならば、さらにまたあなたはあつらえのミラーをCustomReflectable準拠によって提供することを考慮したいかもしれません。

source: If you implement a custom data structure backed by an array that grows dynamically, naively calling the reserveCapacity(_:) method can lead to worse than expected performance.
ja: あなたが動的に増大する配列によって裏打ちされる誂えのデータ構造を実装するならば、無邪気にreserveCapacity(_:)メソッドを呼び出すと予想される性能よりずっと悪くなります。

source: If you know approximately how many elements you will need to store, use the reserveCapacity(_:) method before appending to the array to avoid intermediate reallocations.
ja: どのくらい多くの要素をあなたが格納する必要があるかをあなたがおおよそ知っているならば、配列に追加する前にreserveCapacity(_:)メソッドを使って中間的な再割り当てを回避するようにしてください。

source: If you mutate the collection while iterating over its indices, a strong reference can cause an unexpected copy of the collection.
ja: あなたがコレクションをそれのインデックス全体に反復している間に変化させるならば、ある強い参照はそのコレクションの予期されない複製の原因となります。

source: If you mutate the collection while iterating over its indices, a strong reference can result in an unexpected copy of the collection.
ja: あなたがコレクションをそれのインデックス全体に反復している間に変化させるならば、ある強い参照はそのコレクションの予期しない複製という結果になります。

source: If you need a reversed collection of the same type, you may be able to use the collection’s sequence-based or collection-based initializer.
ja: あなたが同じ型での逆にされたコレクションを必要とするならば、あなたはコレクションのもつシーケンス基盤のまたはコレクション基盤のイニシャライザを使うことができるでしょう。

source: If you need an array that is preinitialized with a fixed number of default values, use the Array(repeating:count:) initializer.
ja: あなたがある固定された数の省略時の値であらかじめ初期化される配列を必要とするならば、Array(repeating:count:)イニシャライザを使ってください。

source: If you need an ordered collection of key-value pairs and don’t need the fast key lookup that Dictionary provides, see the KeyValuePairs type for an alternative.
ja: あなたが順番付けられたキー値ペアのコレクションを必要とするそしてDictionaryが提供する高速な検索を必要としないならば、代わりのものとしてKeyValuePairs型を見てください。

source: If you need more control or only a few results, you can use a pattern like the following:
ja: あなたが更なる制御または少しの結果を必要とするならば、あなたは以下のような手本を使用できます：

source: If you need more control over the capacity of your array, implement your own geometric growth strategy, passing the size you compute to reserveCapacity(_:).
ja: あなたがあなたの配列の容量に関してより制御を必要とするならば、あなた独自の幾何数級的戦略を実装して、あなたが算出する大きさをreserveCapacity(_:)に渡してください。

source: If you need the reference semantics that come with the Foundation reference type, you can access it with its original NS class name prefix.
ja: あなたがFoundation参照型に付属する参照意味論を必要とするならば、あなたはそれに、それの元のNSクラス名接頭辞でアクセスできます。

source: If you need to customize this behavior, override the isEqual(_:) method and hash property instead of the == operator method and hashValue property.
ja: あなたがこの挙動をカスタマイズする必要があるならば、isEqual(_:)メソッドとhashプロトコルをオーバーライドしてください、==演算子メソッドとhashValueプロパティではなく。

source: If you need to infer moves, call the inferringMoves() method on the resulting difference.
ja: あなたが移動の推論を必要とするならば、inferringMoves()メソッドを結果の差異の上で呼び出してください。

source: If you need to iterate over consecutive floating-point values, see the stride(from:through:by:) function.
ja: あなたが連続した不動小数点値にわたって反復適用していく必要があるならば、stride(from:through:by:)関数を見てください。

source: If you need to mutate the argument through the pointer, use withUnsafeMutablePointer(to:_:) instead.
ja: あなたがポインタを通して引数を変化させる必要があるならば、代わりにwithUnsafeMutablePointer(to:_:)を使ってください。

source: If you need to pass an optional pointer as a CVarArg argument, use the Int(bitPattern:) initializer to interpret the optional pointer as an Int value, which has the same C variadic calling conventions as a pointer on all supported platforms.
ja: あなたがオプショナル値をCVarArg引数として渡す必要があるならば、Int(bitPattern:)イニシャライザを使って、オプショナルポインタをInt値として解釈してください、それは全てのサポートされるプラットホーム上のポインタと同じC可変長引数呼出規約を持ちます。

source: If you need to pass those keys to a method that takes an array, however, use this initializer to convert that list from its type of LazyMapCollection<Dictionary<String, Int>, Int> to a simple [String].
ja: しかしながら、あなたが配列を取るメソッドにそれらキーを渡す必要があるならば、このイニシャライザを使ってそのリストをそれの型のLazyMapCollection<Dictionary<String, Int>, Int>から単純な[String]へ変換してください。

source: If you need to perform additional setup beyond initialization, you can assign the result of the invocation of a closure to the global constant:
ja: あなたが追加的な準備を初期化が済んだら実行する必要があるならば、あなたはあるクロージャの発動の結果をグローバル定数に割り当てることができます：

source: If you override one of these declarations, you must also override the other to maintain that guarantee.
ja: あなたがそれら宣言の一方をオーバーライドするならば、あなたはまた他方もオーバーライドしてその保証を維持してください。

source: If you pass true, the operation preserves the buffer capacity that the collection has, otherwise the underlying buffer is released.
ja: あなたがtrueを渡すならば、演算はそのコレクションが持つバッファ容量を保全します、そうでなければ基礎をなすバッファは解放されます。

source: If you pass a value as stride that moves away from end, the sequence contains no values.
ja: あなたがある値をstrideとして渡してそれがendから離れていくならば、シーケンスは全く値を含みません。

source: If you pass a zero-length range as the subrange parameter, this method inserts the elements of newElements at subrange.startIndex.
ja: あなたがゼロ長範囲をsubrangeパラメータとして渡すならば、このメソッドはnewElementsの要素をsubrange.startIndexで挿入します。

source: If you pass the array’s endIndex property as the index parameter, the new element is appended to the array.
ja: あなたが配列のendIndexプロパティをindexパラメータとして渡すならば、新しい要素が配列に追加されます。

source: If you pass the collection’s endIndex property as the index parameter, the new elements are appended to the collection.
ja: あなたがコレクションのendIndexプロパティをindexパラメータとして渡すならば、いくらかの新しい要素がコレクションに追加されます。

source: If you provide your own implementation, make sure to compute the value nondestructively.
ja: あなたがあなた独自の実装を提供するならば、値を非破壊的に計算することを確実にしてください。

source: If you return Core Foundation objects from your own C functions and Objective-C methods, you can annotate them with either the CF_RETURNS_RETAINED or CF_RETURNS_NOT_RETAINED macro to automatically insert memory management calls.
ja: あなたがCore Foundationオブジェクトをあなた独自のC関数およびObjective-Cメソッドから返すならば、あなたはそれらにCF_RETURNS_RETAINEDまたはCF_RETURNS_NOT_RETAINEDマクロのどちらかで注釈をつけて、自動的にメモリ管理呼び出しを差し込むことができます。

source: If you return any other type, a structured description is generated.
ja: あなたが何か他の型を返すならば、構造化された記述が生成されます。

source: If you use 11 as rhs, x is overshifted such that all of its bits are set to zero.
ja: あなたが11をrhsとして使うならば、xは、それのビットのすべてがゼロに設定されるような、オーバーシフトをされます。

source: If you use 2 as the right-hand-side value in an operation on x, the shift amount requires no masking.
ja: あなたが2を右手側の値としてxに関する演算において使うならば、シフト量はマスクを必要としません。

source: If you use 2 as the right-hand-side value in an operation on x, the value is shifted left by two bits.
ja: あなたが2をx上での演算の右手側の値として使うならば、値は2ビットだけ左にシフトされます。

source: If you use 2 as the right-hand-side value in an operation on x, the value is shifted right by two bits.
ja: あなたが2をx上での演算の右手側の値として使うならば、値は2ビットだけ右にシフトされます。

source: If you use an Objective-C API that needs to process your data, or you need to fit your data model into an existing class hierarchy defined in an Objective-C framework, you might need to use classes and class inheritance to model your data.
ja: あなたのデータを処理するのに必要であるObjective-C APIをあなたが使う、またはあなたのデータモデルをObjective-Cフレームワークにおいて定義される既存のクラス階層へと適合させる必要があるならば、あなたはクラスとクラス階層を使ってあなたのデータをモデル化する必要があるかもしれません。

source: If you want a conforming type to differentiate between literal and interpolated segments, restrict the types that can be interpolated, support different interpolators from the ones on String, or avoid constructing a String containing the data, the type must specify a custom StringInterpolation associated type.
ja: あなたがある準拠している型にリテラルと補間分節の間の区別がついて欲しいならば、補間されることが可能な型を制約して、Stringでのものと異なる補間をサポートしてください、またはデータを含んでいるStringを組み立てることを防止してください、その型はあるあつらえのStringInterpolation関連型を指定しなければなりません。

source: If you want to mutate a value by writing through a pointer, use withUnsafeMutableBytes(of:_:) instead.
ja: あなたがある値をポインタを通して書き込むことで変化させたいならば、withUnsafeMutableBytes(of:_:)を代わりに使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow addition operator (&+).
ja: あなたがオーバーフロー検査を取りやめて、あらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー加算演算子（&+）を使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow multiplication operator (&*).
ja: あなたがオーバーフロー検査を取りやめて、あらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー乗算演算子（&*）を使ってください。

source: If you want to opt out of overflow checking and wrap the result in case of any overflow, use the overflow subtraction operator (&-).
ja: あなたがオーバーフロー検査を取りやめてあらゆるオーバーフローの場合に結果をラップしたいならば、オーバーフロー減算演算子（&-）を使ってください。

source: If you want to provide a custom description of your type to be logged in place of the default description, conform to the CustomPlaygroundDisplayConvertible protocol.
ja: あなたの型のあつらえの記述を提供して省略時の記述の代わりに記録されるようにしたいならば、CustomPlaygroundDisplayConvertibleプロトコルに準拠してください。

source: If you're building an inheritance relationship from scratch, prefer protocol inheritance.
ja: あなたが継承関係をゼロから構築するならば、プロトコル継承を選んでください。

source: If you're completely certain about the type of the object, you can use the forced downcast operator (as!) instead.
ja: あなたがオブジェクトの型について完全に確信しているならば、あなたは強制ダウンキャスト演算子（as!）を代わりに使うことができます。

source: If you're new to Swift, read The Swift Programming Language for a quick tour, a comprehensive language guide, and a full reference manual.
ja: あなたがSwiftに慣れていないならば、Swiftプログラミング言語を素早い見学、包括的な言語案内、そして完全な参照手引書として読んでください。

source: If you're new to programming, check out Swift Playgrounds on iPad.
ja: あなたがプログラミング初心者ならば、Swift PlaygroundsをiPadでチェックしましょう。

source: If your app target has an Objective-C bridging header, the generated header also includes interfaces marked with the internal modifier.
ja: あなたのアプリターゲットがObjective-Cブリッジヘッダを含むならば、生成されたヘッダもまたinternal修飾子で印されたインターフェイスを含みます。

source: If your array’s Element type is a class or @objc protocol and you do not need to bridge the array to NSArray or pass the array to Objective-C APIs, using ContiguousArray may be more efficient and have more predictable performance than Array.
ja: あなたの配列のElement型がクラスまたは@objcプロトコルで、あなたがその配列をNSArrayにブリッジしたりその配列をObjective-C APIに渡したりする必要がないならば、ContiguousArrayを使うことはArrayよりもより効率的でありそしてより予測どおりの性能を持つでしょう。

source: If your implementation returns an instance of one of the types above, that type’s specialized description is used.
ja: あなたの実装が上の型の１つのインスタンスを返すならば、その型のもつ特殊化された記述が使われます。

source: If your sequence might have duplicate keys, use the Dictionary(_:uniquingKeysWith:) initializer instead.
ja: あなたのシーケンスが重複するキーを持つかもしれないならば、Dictionary(_:uniquingKeysWith:)イニシャライザを代わりに使ってください。

source: If your type contains properties that don't affect whether two instances are considered equal, exclude those properties from comparison in the == method and from hashing in hash(into:).
ja: ２つのインスタンスが等しいと考えられるかどうかに影響しないプロパティをあなたの型が含むならば、それらプロパティを==メソッドでの比較から、そしてhash(into:)でのハッシュ化から除外してください。

source: If your type has value semantics, the playgroundDescription should be unaffected by subsequent mutations, if possible.
ja: あなたの型が値意味論を持つならば、playgroundDescriptionはその後の変化によって影響を受けないべきです、できれば。

source: If your type’s playgroundDescription returns an instance which itself conforms to CustomPlaygroundDisplayConvertible, then that type’s playgroundDescription will be used, and so on.
ja: あなたの型のもつplaygroundDescriptionがそれ自体がCustomPlaygroundDisplayConvertibleに準拠するインスタンスを返すならば、そのときその型のもつplaygroundDescriptionが使われます、などなど。

source: If you’re passing a generator that results in the same sequence of Boolean values each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じブール値からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。

source: If you’re passing a generator that results in the same sequence of elements each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行するたびごとに同じ要素からなるシーケンスという結果になる生成子を渡すならば、そのシーケンスは、あなたのプログラムが異なるSwiftバージョンを使ってコンパイルされる時に変わるかもしれません。
